namespace HeroesPrototype{public class TO_DO_List{}}
/*Това е клас, който ще използваме, за да отбелязваме кой какви бъгове е намерил 
 * или какво иска да бъде направено, понеже чата се задръства и някои не го четат!
 * 
 * Тук ще са най-важните неща, синтезирани. Започвам аз с листа:
 * 
 * 
 * 
 ************************************************************************************************************************
 ************************************************************************************************************************
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! VAJNOOOOOOOOO !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 ***********          Трябва да се направи някакъв юнит в инферно замъка и,                                    **********
 ***********          за да ти позволи да се биеш с него да си поне 20 или 30 левъл.                           **********
 ***********          Също така, това е битка на живот и смърт, започнеш ли я или печелиш или губиш играта!    **********
 ***********          Поради тази причина може да се направят форми за победа и загуба.                        **********
 ***********          Може тези форми да са само MessageBoxes                                                  **********
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! VAJNOOOOOOOOO !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 * **********************************************************************************************************************
 * **********************************************************************************************************************
 * 
 * 
 * 
 * 1. BuyMenu трябва да се направи така, че новата популация да се добавя към старата, а не да я заменя.
 * 2. Логиката на битката може да се промени малко(но не е толкова наложително).
 * 3. Unit-ите, които са по картата могат да станат листове от юнити, защото ги разбираме повече, и така ще може да не са по 1 юнит, а по много.
 * 4. При инферното трябва да се погледне, има ресурси и юнити, които са с фон, неотговарящ на терена. 
 *  MlaDANCe - вече е оправено. Има още един ресурс, който е с грешен фон.
 * 5. В BuyMenu трябва да се добавят нови юнити. // добавени нови юнити в Castle, които могат да бъдат закупувани
 * 6. Трябва да се добавят още Items. MlaDANCe - аз ще се заема.
 * 7. Трябва да се направи така, че като се вземат айтеми, да имат ефект, че в момента само изчезват. MlaDANCe - аз ще се заема.
 * 8. При загубена битка, единицата не трябва да изчезва, а героя да губи всичките си единици и да се връща на стартовата позиция.
 * 9. По default трябва да направим героя така, че винаги да има поне 1 единица в себе си. Трябва му стартова армия.
 * 10. Трябва да направим героя да дига левъл, като взима експириънс. първия левъл е на 1000 хр, после на 2000, след това на 4000 и т.н - някаква последователност нарастваща.
 * При всеки левъл да дига атака или дефенс - с рандом генератор може или първо едното после другото да ги редува.
 * 11. Някакъв бос трябва да сложим в замъка.
 * 12. Добавих музика, всичко работи, но при край на битка се спира бекграунд музиката и после не мога да я пусна пак ;[ // TODO
 * 13. Трябва да се направи така, че при загуба да може играча и картата да са в стартовата позиция 
 * 
 * 
 * NB! С CTRL + T се отваря изработения от мен трейнър, чийто бутон засега ще оставя Visible в менюто :) . Have fun with it ;]
 */
