namespace HeroesPrototype{public class TO_DO_List{}}
/*Това е клас, който ще използваме, за да отбелязваме кой какви бъгове е намерил 
 * или какво иска да бъде направено, понеже чата се задръства и някои не го четат!
 * 
 * Тук ще са най-важните неща, синтезирани. Започвам аз с листа:
 * 
 * 1. BuyMenu трябва да се направи така, че новата популация да се добавя към старата, а не да я заменя.
 * 2. Логиката на битката може да се промени малко(но не е толкова наложително).
 * 3. Unit-ите, които са по картата могат да станат листове от юнити, защото ги разбираме повече, и така ще може да не са по 1 юнит, а по много.
 * 4. При инферното трябва да се погледне, има ресурси и юнити, които са с фон, неотговарящ на терена. - Оправено трябва да е.
 * 
 * 
 */
